In [3]:
import pandas as pd
import numpy as np

In [4]:
dt = pd.read_csv("happiness.csv")

In [5]:
dt.head()

  Country  Gender Mean    N=
0      AT    Male  7.3   471
1     NaN  Female  7.3   570
2     NaN    Both  7.3  1041
3      BE    Male  7.8   468
4     NaN  Female  7.8   542

In [6]:
dt.isna().sum()

Country    70
Gender      0
Mean        0
N=          0
dtype: int64

In [7]:
dt[dt['Country'].isnull()]

    Country  Gender Mean     N=
1       NaN  Female  7.3    570
2       NaN    Both  7.3   1041
4       NaN  Female  7.8    542
5       NaN    Both  7.8   1010
7       NaN  Female  5.8    555
..      ...     ...  ...    ...
98      NaN    Both  7.6  17615
100     NaN  Female  7.1   7531
101     NaN    Both  7.2  12819
103     NaN  Female  7.5  17366
104     NaN    Both  7.5  30434

[70 rows x 4 columns]

In [8]:
dt['Country'].unique()

array(['AT', nan, 'BE', 'BG', 'CY', 'CZ', 'DE', 'DK', 'EE', 'GR', 'ES',
       'FI', 'FR', 'HR', 'HU', 'IE', 'IT', 'LT', 'LU', 'LV', 'MK', 'MT',
       'NL', 'NO', 'PL', 'PT', 'RO', 'SE', 'SI', 'SK', 'TR', 'UK', 'CC3',
       'EU 15', 'NMS12', 'EU 27'], dtype=object)

In [9]:
cont_mode = dt.Country.mode()[0]

In [10]:
print("Mode for Country : " , cont_mode)

Mode for Country :  AT

In [11]:
dt.Country.fillna(cont_mode , inplace=True)

In [12]:
dt.isna().sum()

Country    0
Gender     0
Mean       0
N=         0
dtype: int64